In [3]:
# Import the pandas module and alias it as 'pd'
import pandas as pd
from pathlib import Path

 # Read CSV File

In [4]:
csvpath = Path("./sales.csv")
sales_dataframe = pd.read_csv(csvpath)

 ## Type Checking

In [5]:
# Head check the first five line
sales_dataframe.head()

          FullName                   Email    Zip  SalePrice
0    Elwanda White      alyre2036@live.com   9236      84.33
1   Lyndon Elliott  arrowy1873@outlook.com   1330     879.95
2   Daisey Sellers  toucan2024@outlook.com   7631     907.58
3     Issac Reeves    asarin1958@gmail.com  81168     545.88
4  Bradford Kinney  mibound1801@yandex.com  41721     517.49

In [6]:
# Check type of an element in list_of_numbers
new_csvpath = Path("./sales_no_header.csv")

In [7]:
# Create a Series from the list
no_header_df = pd.read_csv(new_csvpath)
no_header_df.head()

     Elwanda White       alyre2036@live.com   9236   84.33
0   Lyndon Elliott   arrowy1873@outlook.com   1330  879.95
1   Daisey Sellers   toucan2024@outlook.com   7631  907.58
2     Issac Reeves     asarin1958@gmail.com  81168  545.88
3  Bradford Kinney   mibound1801@yandex.com  41721  517.49
4     Fermina Cobb  kingfisher2013@live.com  16625  889.95

# Read the csv file without any header

In [9]:
# Print the Series
new_no_header_data = pd.read_csv(new_csvpath, header=None)
new_no_header_data.head()

                 0                       1      2       3
0    Elwanda White      alyre2036@live.com   9236   84.33
1   Lyndon Elliott  arrowy1873@outlook.com   1330  879.95
2   Daisey Sellers  toucan2024@outlook.com   7631  907.58
3     Issac Reeves    asarin1958@gmail.com  81168  545.88
4  Bradford Kinney  mibound1801@yandex.com  41721  517.49

In [10]:
# Return the data type of the elements in the series
columns = ["Full Name", "Email", "Zip Code", "Sale Price"]
new_no_header_data.columns = columns
new_no_header_data.head()

         Full Name                   Email  Zip Code  Sale Price
0    Elwanda White      alyre2036@live.com      9236       84.33
1   Lyndon Elliott  arrowy1873@outlook.com      1330      879.95
2   Daisey Sellers  toucan2024@outlook.com      7631      907.58
3     Issac Reeves    asarin1958@gmail.com     81168      545.88
4  Bradford Kinney  mibound1801@yandex.com     41721      517.49

# Rename columns usign python dictionaries

In [12]:
# Return the element at index 0 using list syntax
new_no_header_data = new_no_header_data.rename(columns={
    "Full Name": "Name"
})

new_no_header_data.head()

              Name                   Email  Zip Code  Sale Price
0    Elwanda White      alyre2036@live.com      9236       84.33
1   Lyndon Elliott  arrowy1873@outlook.com      1330      879.95
2   Daisey Sellers  toucan2024@outlook.com      7631      907.58
3     Issac Reeves    asarin1958@gmail.com     81168      545.88
4  Bradford Kinney  mibound1801@yandex.com     41721      517.49

 # Series Methods

In [ ]:
# Get the count of the number of times a value occurs in a Series

In [ ]:
# Get the unique values of a Series

In [ ]:
# A function to triple any value


# Apply triple value to series_of_numbers

 # Dictionary Example

In [ ]:
# A dictionary of stock values

In [ ]:
# Create series object from dictionary

 ## Datatype conversion

In [ ]:
# Return the data type of the elements in the series

In [ ]:
# Apply float to each item in the series

In [ ]:
# Return the data type of the elements in the series

 ## Different Methods to Access Values

In [ ]:
# Access value at index location 0 using iloc

# Access value at index location 0 using list syntax

# Access value at index MSFT

 ## Appending Data to Series

In [ ]:
# Create a new stock series for google stock. The dictionary is passed in directly.

In [ ]:
# Append the new data without reassignment

In [ ]:
# Append the new data with reassignment

 ## Removing Data from Series

In [ ]:
# Drop MSFT in-place

 ## Updating Series Data

In [ ]:
# Update using list syntax

In [ ]:
# Update using named index label

 ## Iterating Over Series

In [ ]:
# Print prices

In [ ]:
# Print symbol and price